# 4.Напишите программу, которая по заданному номеру четверти, 
#   показывает диапазон возможных координат точек в этой четверти (x и y).

num = int(input("Введите цифру четверти: "))

if num == 1:
    print("x = 1, 2... y = 1, 2... ")
if num == 2:
    print("x = 1, 2... y = -1, -2... ")
if num == 3:
    print("x = -1, -2... y = -1, -2... ")
if num == 4:
    print("x = -1, -2... y = 1, 2... ")