# Задача: предложить улучшения кода для уже решённых задач(3-5 задач):
# С помощью использования лямбд, filter, map, zip, enumerate, list comprehension

# LAMBDA
a = int(input("Введите число которое хотите возвести в куб: "))
cube = (lambda x: x**3)
print(cube(a))